"use client";

import Link from "next/link";

export default function Star() {
  return (
    <main className="bg-black text-white min-h-screen p-8">
      {/* 右上ロゴ */}
<div className="fixed top-4 right-4 w-32 h-auto z-50">
  <img src="/project_Emo_RAMUNE_logo.png" alt="Project Emo-RAMUNE" className="w-full h-auto" />
</div>

      {/* タイトル */}
      <h1 className="text-2xl mb-6">シィアの星</h1>
      <h1 className="text-s opacity-60">
      <h1>
        これはとある宇宙の神話の世界での物語。人と竜の2つの特徴を持つ「星の子」は成長すると星になる。
      </h1>
      <h1>
        星になるためには星音（星が発する歌）を奏でられる（歌える）ようにならなければならない。
      </h1>
      <h1>
      これは、ある残酷なまでに優しい星の子と、その親友の星の子のお話。
        </h1>
        </h1>

      {/* 本文 */}
      <div className="max-w-2xl leading-relaxed space-y-4 text-sm">
      <p>
          
        </p>
        <p>
          　
        </p>
        <p>
        ――晴れた日の午後だった。シィアはいつもみたいに一人街のはずれの草原で空を見ていた。
        </p>
        <p>
        　
        </p>
        <p>
         「こんにちはシィア！今日も雲を数えてるの？」
        </p>

        <p>
        「ええ、今日はあんまり雲ないけれどね。あはは！」
        </p>

        <p>
        「隣いい？」
        </p>

        <p>
        「うん！今日がティカと一緒に雲を数えられる最後の日だものね！」
        </p>
        <p>
        　
        </p>
        <p>
        やわらかく笑うシィアの頬には痣ができていた。
        </p>

        <p>
        これが草原を駆け回って転んでできたものだったら、どれだけ良かったことか。
        </p>
        <p>
        シィアはおとなしくて、身体も弱いからそんなことは普通しない。
        </p>
        <p>
        　
        </p>
        <p>
        「……今日も？」
        </p>
        <p>
        「うん、広場でね。第七九星団と私の名前が似ているのが気に入らないって。それでみんなから"改名しろ"なんて言われたんだけれど、"でも私の名前は、神様から授かった大切な名前なの"って言ったら、またぶたれてしまって。えへへ……」
        </p>
        <p>
        「……最悪。本当にバカでクズな奴らだよ。シィアもやり返しちゃえばよかったのに。」
        </p>
        <p>
        「しないわよ、そんなこと。みんなこれから一等星になるのに、怪我しちゃったら大変でしょ？せっかくの晴れ舞台を台無しにしてはいけないわ。」
        </p>
        <p>
        　
        </p>
        <p>
        シィアをいじめているのは、星歌の継承で裕福になった子や星音を奏でるのが上手かったり、角や尻尾が綺麗な人気者の子たち。
        </p>
        <p>
        シィアはずっと、名前のことと角や尻尾の模様や色のこと、身体が弱いことをからかわれて、酷い言葉をかけられて、手をあげられてきた。
        </p>
        <p>
        何度も何度も痣や擦り傷を作っていた。
        </p>
        <p>
        今では広場を通るだけで文句を言われたり、足をかけられたり、酷いときは土塊を投げつけられたりする。
        </p>
        <p>
        それでもシィアは優しいから、やり返さない。
        </p>
        <p>
        むしろみんなの邪魔をしないようにと、この誰も来ない草原にいつも来ている。
        </p>
        <p>
        　
        </p>
        <p>
        私はそれが許せない。
        </p>
        <p>
        シィアはこんなに優しくていい子なのに、いじめてるあの子らの方が目立つ場所で強く輝く星になれるなんて。
        </p>
        <p>
        ひどく腹立たしい。
        </p>
        <p>
        シィアにしたことと同じことを、一人一人にしてやりたいくらい。
        </p>
        <p>
        いや、それだけでは足りない。いじめた子たちらから声を奪ってしまいたいくらいだ。
        </p>
        <p>
        　
        </p>
        <p>
        明日はシィアが星になる日。
        </p>
        <p>
        私より一つ年上のシィアは、私より先に星になる。
        </p>
        <p>
        そんな喜ばしい日の前にまで、あの子らはシィアをいじめたなて。
        </p>
        <p>
        　
        </p>
        <p>
        煮えくり返りそうな私の心をそっと撫でるように、シィアは手を握ってくれた。

        </p>
        <p>
        　
        </p>
        <p>
        「風が気持ちいわね、ティカ。思えば、私たちが初めて出会った日も、こんな風の気持ちいい晴れた日の午後だったわね。」
        </p>
        <p>
        「……うん。シィアの星音がとても綺麗に響いて、優しくてとろけちゃいそうな心地だった。」
        </p>
        <p>
        「あはは、うれしい！みんな私の星音はか細くてつまらないと言うから、いつもティカに褒めてもらえてとってもうれしいわ！」
        </p>
        <p>
        　
        </p>
        <p>
        そう言うと、シィアは立ち上がって尾で風を切り、歌い始めた。
        </p>
        <p>
        　
        </p>
        <p>
        「sol de sive lua ti elna〜♪」
        </p>
        <p>
        　
        </p>
        <p>
        まるでこの空みたいに澄んだ声で、優しく響くシィアの星音。つまらないなんて全くない、綺麗な音。
        </p>
        <p>
        頬を撫でる涼やかな風と混じった星音は遠くの空へゆるりと昇っていく。
        </p>
        <p>
        　
        </p>
        <p>
        歌い終わるとシィアは腰を下ろして満足げに笑っていた。
        </p>
        <p>
        　
        </p>
        <p>
        「ねえ、シィア。シィアはどこの空に昇るか決めた？」
        </p>
        <p>
        「うん。ここから見える空にしようと思うの。そうしたら、誰の邪魔にもならないし、みんなが気持ちよく輝いて、星音を奏でられるでしょ？」
        </p>
        <p>
        　
        </p>
        <p>
        屈託のない笑顔が、痛いくらい眩しかった。どうしてこの子はこんなにも優しくて痛々しいのだろう。
        </p>
        <p>
        どうしてこんなにも残酷な選択をしてしまうのだろう。
        </p>
        <p>
        　
        </p>
        <p>
        私はシィアが誰よりも好きだ。
        </p>
        <p>
        だから、シィアが酷い目に遭うのは誰よりも許せない。
        </p>
        <p>
        シィアには誰よりもいい場所で星になってほしかった。
        </p>
        <p>
        あのいじめっ子たちが霞むくらい、綺麗な星音を響かせてほしかった。
        </p>
        <p>
        　
        </p>
        <p>
        けれど、このまっすぐな笑顔のシィアは、そんなこと望んではいないんだろう。
        </p>
        <p>
        本気で、自分をいじめていた子たちの幸せを願っているんだ。
        </p>
        <p>
        　
        </p>
        <p>
        そう思うと、余計に心が痛くなる。悔しくなる。
        </p>
        <p>
        　
        </p>
        <p>
        「……ねえ、シィア。あのね、ひとつ、わがままを言ってもいい？」
        </p>
        <p>
        「わがまま？うん、いいわよ。ティカのわがままならどんなものだって聞いてあげる！」
        </p>
        <p>
        　
        </p>
        <p>
        私はシィアのあたたかな手を握って、その宝石みたいに澄んだ目を見つめて言った。
        </p>
        <p>
        　
        </p>
        <p>
        「もしも、もしもね、私が星になるならシィアの隣がいい。シィアと並んで星になりたい――」
        </p>
        <p>
        　
        </p>
        <p>
        シィアは目をまんまるくしていた。
        </p>
        <p>
        　
        </p>
        <p>
        それはそうだ。
        </p>
        <p>
        流石に一等星の輝きは無理だし、目立つ場所で星にはなれないけれど、私はもっと人目につく場所を選べる。
        </p>
        <p>
        星団にはなれなくとも、少なくとも星座くらいにはなれる。
        </p>
        <p>
        　
        </p>
        <p>
        でも、そうだとしても私は、シィアの隣がよかった。
        </p>
        <p>
        　
        </p>
        <p>
        「ティカ、本気で言ってるの……？だってティカは……」
        </p>
        <p>
        「いいの、いいの。私はシィアの隣がいい。まだ星音も上手く奏でられないし、年も一つ下だから、星になるのはもう少し先になると思うけどね。」
        </p>
        <p>
        　
        </p>
        <p>
        シィアは嬉しそうに笑って、私を抱きしめた。
        </p>
        <p>
        その手が少し震えていることに気がついたけれど、今は黙ったまま。
        </p>
        <p>
        私は優しく抱き返す。
        </p>
        <p>
        　
        </p>
        <p>
        「嬉しい……！嬉しいわ、ティカ……。あなたと出会えて本当によかった……！大好きよ！」
        </p>
        <p>
        「うん、私も大好きだよ！」
        </p>
        <p>
        　
        </p>
        <p>
        こちらに向き直ったシィアの目には少し涙が滲んでいた。
        </p>
        <p>
        　
        </p>
        <p>
        そうだ、それでいいんだ。
        </p>
        <p>
        弱音を吐いたっていい。
        </p>
        <p>
        せめて私の前では弱さを見せていい。
        </p>
        <p>
        いくら優しくても、いい子でも、シィアは一人の星の子なんだ。
        </p>
        <p>
        　
        </p>
        <p>
        私は嬉しかった。
        </p>
        <p>
        ほんの少しでも、私に弱さを見せてくれたシィアの涙が。
        </p>
        <p>
        最後の最後で、ようやく一人で全部抱えることを諦めてくれたと思った。
        </p>
        <p>
        　
        </p>
        <p>
        「……ねえ、シィア。シィアは一人で星になるの怖くない？」
        </p>
        <p>
        　
        </p>
        <p>
        問いかけた。
        </p>
        <p>
        　
        </p>
        <p>
        そう、もっと見せてほしかったんだ。
        </p>
        <p>
        もっと頼ってほしかった。
        </p>
        <p>
        そうされるのが嬉しいと思ったから。
        </p>
        <p>
        だから、こんな言葉が出てしまった。
        </p>
        <p>
        　
        </p>
        <p>
        でも、やはりシィアは強い子だ。
        </p>
        <p>
        私が心配しないように、これ以上私を縛らないように。
        </p>
        <p>
        　
        </p>
        
        <p>
        苦しいほど素直に笑っていた――
        </p>
        <p>
        　
        </p>
        <p>
        　
        </p>
        <p>
        その夜、シィアは言っていた通り、あの草原から見える夜空で星になった。
        </p>
        <p>
        星の子が星になる瞬間は見てはいけないという掟があるから、午後にした会話がシィアとの最後になった。
        </p>
        <p>
        　
        </p>
        <p>
        それから1年が経って、私はまたここで夜空を見上げている。
        </p>
        <p>
        何もない漆黒の闇の空にひとつ、青白い光が淡く瞬いている。
        </p>
        <p>
        その星に手を伸ばして、懐かしい星音に包まれる。
        </p>
        <p>
        　
        </p>
        <p>
        心を抉るくらい優しくて綺麗な音色。
        </p>
        <p>
        　
        </p>
        <p>
        ――私は今にも、燃えてしまいそうだ。
        </p>
        <p>
        　
        </p>
        <p>
        　
        </p>
        <p>
        　
        </p>
        <p>
        　
        </p>
      </div>

      {/* 戻る */}
      <div className="mt-16">
        <Link href="/Archive/novel">
          <button className="border px-4 py-2 hover:bg-white hover:text-black transition">
            ← 一覧へ戻る
          </button>
        </Link>
      </div>

    </main>
  );
}
